n = int(input('скільки ваша машина проїзджає за день'))
while n < 0:
    print('відстань не може бути менше 0')
    n = int(input('скільки ваша машина проїзджає за день'))
while n > 10000:
    print('ви не можете проїхати більше ніж 10000')
    n = int(input('скільки ваша машина проїзджає за день'))

m = int(input('скільки ви хочете проїхати'))
while n < 0:
    print('відстань не може бути менше 0')
    n = int(input('скільки ви хочете проїхати'))
while m > 10000:
    print('ви не можете проїхати більше ніж 10000')
    m = int(input('скільки ви хочете проїхати'))

h = n/m

print('ви проїдете за ',h,'днів')